# 字典的要求
# 1.中间词不能是常用词汇
# 2.中间词要尽量保证在中日互译时不会产生歧义
# 3.中间词不能在中日互译时发生繁简转换
# 4.要实现贪婪匹配，子串应在母串之后出现
JPNameDict = {
    "モブ美さん": "佐藤",
    "モブ美": "佐藤",
    "モブ男さん": "田中",
    "モブ男くん": "田中",
    "モブ男": "田中",
    "モブくん": "中村",
    "失恋フラグさん": "井上",
    "失恋フラグ": "井上",
    "フラグちゃん": "山本",
    "死亡フラグさん": "小林",
    "死亡フラグ": "小林",
    "恋愛フラグさん": "伊藤",
    "恋愛フラグ": "伊藤",
    "生存フラグさん": "加藤",
    "生存フラグ": "加藤",
    "しーちゃん": "森中",
    "せーちゃん": "石川",
    "れんれん": "松下",
}
ZhNameDict = {
    "佐藤": "小美",
    "田中": "路人男",
    "中村": "路人君",
    "井上": "失恋flag",
    "山本": "flag酱",
    "小林": "死亡flag",
    "伊藤": "恋爱flag",
    "加藤": "生存flag",
    "森中": "死酱",
    "石川": "生酱",
    "松下": "恋恋",
}

hirakanaList = [("か","が"),("き","ぎ"),("く","ぐ"),("け","げ"),("こ","ご"),("さ","ざ"),("し","じ"),("す","ず"),("せ","ぜ"),("そ","ぞ"),("た","だ"),("ち","ぢ"),("つ","づ"),("て","で"),("と","ど"),("は","ば","ぱ"),("ひ","び","ぴ"),("ふ","ぶ","ぷ"),("へ","べ","ぺ"),("ほ","ぼ","ぽ")]

katakanaList = [("カ","ガ"),("キ","ギ"),("ク","グ"),("ケ","ゲ"),("コ","ゴ"),("サ","ザ"),("シ","ジ"),("ス","ズ"),("セ","ゼ"),("ソ","ゾ"),("タ","ダ"),("チ","ヂ"),("ツ","ヅ"),("テ","デ"),("ト","ド"),("ハ","バ","パ"),("ヒ","ビ","ピ"),("フ","ブ","プ"),("ヘ","ベ","ペ"),("ホ","ボ","ポ")]